huygithcm/code_tung/esp32_car/src/main.cpp
/*
 * FIRMWARE TEST / HIEU CHUAN  -  Xe do line ESP32
 * Test: 2 Motor DC (L298N) + 2 Encoder + Servo tha hang + Buzzer
 *
 * Dieu khien qua Serial Monitor (115200 baud, gui kem Newline).
 * Go lenh roi Enter. Go "?" de xem menu.
 *
 * Chua bat WiFi - chi de test phan cung va lay so lieu hieu chuan
 * (duong kinh banh, PPR encoder, goc servo giu/tha).
 */

#include <Arduino.h>
#include <ESP32Servo.h>
#include <Preferences.h>
#include <WiFi.h>
#include <WebServer.h>
#include <WebSocketsClient.h>
#include <ArduinoJson.h>

// ===================== WiFi (STA - noi WiFi nha) =====================
// SUA ten/mat khau WiFi nha ban o day:
#define WIFI_SSID "TEN_WIFI"       // <-- SUA ten WiFi
#define WIFI_PASS "MAT_KHAU_WIFI"  // <-- SUA mat khau WiFi

// Hub (server Node) - IP may chay server + cong WS THUONG cho xe (= PORT+2 = 3002)
#define HUB_HOST "192.168.1.164"   // <-- SUA IP may chay server.js
#define HUB_PORT 3002

WebServer server(80);
bool wifiOK = false;
Preferences prefs;

// ===================== Che do build =====================
// -DDEBUG_MODE=1 (env:debug)  -> in log, telemetry dinh ky
// -DDEBUG_MODE=0 (env:release)-> tat log de chay nhanh/gon
#ifndef DEBUG_MODE
#define DEBUG_MODE 1          // mac dinh: debug
#endif
#if DEBUG_MODE
  #define DBG(...)   Serial.printf(__VA_ARGS__)
  #define DBGLN(x)   Serial.println(x)
#else
  #define DBG(...)   do{}while(0)
  #define DBGLN(x)   do{}while(0)
#endif

// ===================== CHAN (theo PLAN.md) =====================
// Motor A (banh TRAI)
#define MA_IN1 18
#define MA_IN2 19
#define MA_EN  21
// Motor B (banh PHAI)
#define MB_IN3 22
#define MB_IN4 4
#define MB_EN  16
// Encoder trai (A/B)  -- da hoan doi: 2 encoder bi dao nhau tren xe
#define ENC_L_A 15
#define ENC_L_B 17
// Encoder phai (A/B)  -- dao A/B de sua chieu dem
#define ENC_R_A 14
#define ENC_R_B 13
// Servo tha hang
#define SERVO_PIN 5
// Buzzer
#define BUZZER 23
// MUX 74HC4067 (8 mat do line)
#define MUX_SIG 36
#define MUX_S0  27
#define MUX_S1  26
#define MUX_S2  25
#define MUX_S3  33
#define LINE_THRESHOLD 2000   // nguong den/trang (analog 0..4095)
// Mat cam bien con tot (false = bo qua). C1 hong -> mask.
bool SENSOR_OK[8] = { false, true, true, true, true, true, true, true };

// ===================== PWM (LEDC) =====================
#define PWM_FREQ 5000   // 5 kHz cho motor
#define PWM_RES  8      // 8-bit -> duty 0..255
#define MA_CH    2      // LEDC channel Motor A (ENA)
#define MB_CH    3      // LEDC channel Motor B (ENB)
#define BUZZER_CH 1     // LEDC channel Buzzer (phat tone)

// ===================== Thong so hieu chuan =====================
// Sua sau khi do thuc te
float WHEEL_DIAMETER_MM = 70.0;   // duong kinh banh (mm)
int   ENCODER_PPR       = 370;    // so xung / vong
float WHEEL_BASE_MM     = 170.0;  // khoang cach tam 2 banh sau (mm)
float CASTER_DIST_MM    = 100.0;  // khoang cach truc banh sau -> banh tu do (mm)

// Goc servo (do)
int SERVO_HOLD = 0;    // goc GIU hang
int SERVO_DROP = 90;   // goc THA hang

// Dao chieu motor neu banh quay nguoc (doi true/false roi flash lai)
bool INVERT_A = true;   // banh TRAI (L)
bool INVERT_B = true;   // banh PHAI (R)

// ===================== Bien toan cuc =====================
Servo servo;
int   motorSpeed = 150;            // toc do hien tai 0..255
volatile long encL = 0;            // dem xung encoder trai
volatile long encR = 0;            // dem xung encoder phai
bool  streamLine = false;          // true = in lien tuc gia tri 8 mat
int   lineRaw[8];                  // gia tri analog 8 mat (C1..C8)
int   lineMin[8], lineMax[8];      // min/max moi mat khi cali
int   lineThresh[8];               // nguong rieng moi mat
bool  lineCalibrated = false;      // da cali chua

// --- Bam line PID ---
bool  lineFollow = false;          // dang bam line?
float Kp = 25.0, Ki = 0.0, Kd = 15.0;
float lineError = 0, lastError = 0, errIntegral = 0;
int   baseSpeed = 130;             // toc do co ban khi bam line
bool  lineLost = false;            // mat line?

// --- Odometry (toa do tuong doi) ---
float poseX = 0, poseY = 0, poseTheta = 0;   // mm, mm, rad
long  lastOdoL = 0, lastOdoR = 0;

// --- Re chuan bang PID (quay tai cho theo goc) ---
float KpT = 200.0, KdT = 35.0;    // he so PID re (autotune: err<1deg, settled ~0.6s)
float TURN_TOL_DEG = 1.5;         // sai so chap nhan (do)
int   TURN_MIN = 110;             // PWM toi thieu de thang ma sat khi quay
int   TURN_MAX = 255;             // PWM toi da khi quay (full PWM de du luc pha ma sat khi chinh)
bool  turnVerbose = false;        // true = xuat trace step-response (cho autotune)
bool  INVERT_TURN = false;        // dao chieu actuation vong re (sua bang serial: TI)

// --- Dieu phoi: WebSocket client toi hub + bo thuc thi route ---
WebSocketsClient wsClient;
bool   hubOK = false;             // dang ket noi hub?
String route[48];                 // chuoi buoc F/L/R/B/DROP/HOME
int    routeN = 0, routeIdx = 0;  // so buoc + buoc dang chay
String routeTarget = "";          // ma o dang giao (C1..C9), "" = khong
bool   running = false;           // dang chay 1 don giao?
int    stepPhase = 0;             // 0 = re/khoi dong doan, 1 = dang tien
float  segStartX = 0, segStartY = 0;  // moc odometry dau doan
bool   leftStart = false;         // da roi giao diem xuat phat cua doan chua
bool   cargo = true;              // con hang tren xe?
int    lineCount = 0;             // so mat thay den o lan doc gan nhat
const float MIN_EDGE = 120;       // mm toi thieu 1 doan truoc khi cho ket thuc
const float MAX_EDGE = 750;       // mm toi da 1 doan (chan runaway neu miss giao diem)
const int   INTERSECT_N = 5;      // >= so mat thay den => coi la giao diem (nga tu)

// ===================== Encoder ISR (quadrature) =====================
void IRAM_ATTR isrEncL() {
  // doc kenh B de biet chieu
  if (digitalRead(ENC_L_B)) encL++; else encL--;
}
void IRAM_ATTR isrEncR() {
  if (digitalRead(ENC_R_B)) encR++; else encR--;
}

// ===================== MUX 74HC4067 =====================
// Doc 1 kenh (0..15)
int readMuxChannel(int ch) {
  digitalWrite(MUX_S0, ch & 0x01);
  digitalWrite(MUX_S1, (ch >> 1) & 0x01);
  digitalWrite(MUX_S2, (ch >> 2) & 0x01);
  digitalWrite(MUX_S3, (ch >> 3) & 0x01);
  delayMicroseconds(60);          // cho MUX + ADC on dinh (giam crosstalk)
  analogRead(MUX_SIG);            // mau bo (xa dien tich kenh truoc)
  long sum = 0;
  for (int k = 0; k < 4; k++) sum += analogRead(MUX_SIG);  // trung binh 4 mau
  return (int)(sum / 4);
}

// Doc 8 mat line (CH0..CH7 = C1..C8, trai -> phai) vao lineRaw[]
void readLine() {
  for (int i = 0; i < 8; i++) lineRaw[i] = readMuxChannel(i);
}

// In gia tri 8 mat + dang nhi phan theo nguong
void printLine() {
  readLine();
  Serial.print("RAW: ");
  for (int i = 0; i < 8; i++) { Serial.printf("%4d ", lineRaw[i]); }
  Serial.print(" | LINE(den=1): ");
  for (int i = 0; i < 8; i++) {
    if (!SENSOR_OK[i]) { Serial.print("x"); continue; }   // mat bi mask
    int th = lineCalibrated ? lineThresh[i] : LINE_THRESHOLD;
    Serial.print(lineRaw[i] < th ? "1" : "0");   // den = gia tri thap = 1
  }
  Serial.println();
}

// ===================== Motor =====================
// chieu: +1 thuan, -1 nghich, 0 dung
void setMotorA(int dir, int spd) {
  if (INVERT_A) dir = -dir;
  digitalWrite(MA_IN1, dir > 0);
  digitalWrite(MA_IN2, dir < 0);
  ledcWrite(MA_CH, dir == 0 ? 0 : spd);
}
void setMotorB(int dir, int spd) {
  if (INVERT_B) dir = -dir;
  digitalWrite(MB_IN3, dir > 0);
  digitalWrite(MB_IN4, dir < 0);
  ledcWrite(MB_CH, dir == 0 ? 0 : spd);
}
void stopMotors() { setMotorA(0, 0); setMotorB(0, 0); }

// Dieu khien motor theo van toc co dau (-255..255)
void driveA(int v) { v = constrain(v, -255, 255); setMotorA(v > 0 ? 1 : (v < 0 ? -1 : 0), abs(v)); }
void driveB(int v) { v = constrain(v, -255, 255); setMotorB(v > 0 ? 1 : (v < 0 ? -1 : 0), abs(v)); }

// ===================== Odometry =====================
// Cap nhat toa do (x,y,theta) tu so xung encoder. Goi lien tuc trong loop.
void updateOdometry() {
  long l = encL, r = encR;
  long dL = l - lastOdoL;
  long dR = r - lastOdoR;
  lastOdoL = l; lastOdoR = r;
  if (dL == 0 && dR == 0) return;

  float mmPerPulse = (PI * WHEEL_DIAMETER_MM) / ENCODER_PPR;
  float sL = dL * mmPerPulse;
  float sR = dR * mmPerPulse;
  float dS = (sL + sR) * 0.5f;                 // quang duong tam xe
  float dTheta = (sR - sL) / WHEEL_BASE_MM;    // thay doi huong (rad)

  // tich phan vi tri (dung huong giua doan de chinh xac hon)
  poseX += dS * cosf(poseTheta + dTheta * 0.5f);
  poseY += dS * sinf(poseTheta + dTheta * 0.5f);
  poseTheta += dTheta;
}

void resetOdometry() {
  encL = 0; encR = 0; lastOdoL = 0; lastOdoR = 0;
  poseX = poseY = poseTheta = 0;
}

// In toa do hien tai
void printPose() {
  Serial.printf("[pose] x=%.1fmm  y=%.1fmm  theta=%.1f deg  (encL=%ld encR=%ld)\n",
                poseX, poseY, poseTheta * 180.0f / PI, encL, encR);
}

// ===================== Tinh sai so line =====================
// Tra ve TRUE neu thay line. Cap nhat lineError (am=line lech trai, duong=phai).
// Den = gia tri THAP -> mat thay line khi raw < nguong.
bool computeLineError() {
  readLine();
  // trong so vi tri C1..C8: -3.5 .. +3.5 (giua C4-C5 = 0)
  static const float W[8] = {-3.5,-2.5,-1.5,-0.5, 0.5, 1.5, 2.5, 3.5};
  float sum = 0; int cnt = 0;
  for (int i = 0; i < 8; i++) {
    if (!SENSOR_OK[i]) continue;                   // bo qua mat hong
    int th = lineCalibrated ? lineThresh[i] : LINE_THRESHOLD;
    if (lineRaw[i] < th) { sum += W[i]; cnt++; }   // mat thay vach den
  }
  lineCount = cnt;
  if (cnt == 0) { lineLost = true; return false; } // mat line
  lineLost = false;
  lineError = sum / cnt;                            // vi tri trung binh cua line
  return true;
}

// ===================== Vong dieu khien bam line =====================
void lineFollowStep() {
  bool found = computeLineError();
  if (!found) {
    // Mat line: quay tai cho theo huong lech cuoi cung de tim lai
    int dir = (lastError >= 0) ? 1 : -1;
    driveA(-dir * baseSpeed); driveB(dir * baseSpeed);
    return;
  }
  // PID
  errIntegral += lineError;
  errIntegral = constrain(errIntegral, -50, 50);
  float d = lineError - lastError;
  float correction = Kp * lineError + Ki * errIntegral + Kd * d;
  lastError = lineError;

  int left  = baseSpeed - (int)correction;   // line lech phai (error>0) -> phai nhanh hon, xe re phai
  int right = baseSpeed + (int)correction;
  driveA(left); driveB(right);
}

// ===================== Re chuan bang PID =====================
// Quay tai cho mot goc tuong doi (deg). Duong = quay trai (CCW), am = phai.
// Dung poseTheta lam phan hoi, PID dieu khien toc do quay, co timeout.
void turnRelative(float deg) {
  float startTheta = poseTheta;
  float target = poseTheta + deg * PI / 180.0f;
  float tol = TURN_TOL_DEG * PI / 180.0f;
  float lastErr = 0;
  float maxOverDeg = 0;             // vot lo lon nhat (deg)
  float dirSign = (deg >= 0) ? 1.0f : -1.0f;
  int settle = 0;
  bool settled = false;
  unsigned long t0 = millis();

  // --- Bo nho ghi trace step-response (cho autotune) ---
  const int TRMAX = 500;
  static uint16_t trT[TRMAX];        // thoi gian (ms tu khi bat dau)
  static float    trA[TRMAX];        // goc da quay (deg, theo huong re)
  int trN = 0;

