huygithcm/code_tung/esp32_car/src/main.cpp
// ===================== Xu ly lenh =====================
void handleCommand(String cmd) {
  cmd.trim();
  if (cmd.length() == 0) return;
  char c = cmd.charAt(0);

  switch (c) {
    // ----- Motor -----
    case 'f': setMotorA(+1, motorSpeed); setMotorB(+1, motorSpeed);
              Serial.println("Ca 2 banh TIEN"); break;
    case 'b': setMotorA(-1, motorSpeed); setMotorB(-1, motorSpeed);
              Serial.println("Ca 2 banh LUI"); break;
    case 'l': setMotorA(-1, motorSpeed); setMotorB(+1, motorSpeed);
              Serial.println("Quay TRAI"); break;
    case 'r': setMotorA(+1, motorSpeed); setMotorB(-1, motorSpeed);
              Serial.println("Quay PHAI"); break;
    case '1': setMotorA(+1, motorSpeed); setMotorB(0, 0);
              Serial.println("Chi banh TRAI tien"); break;
    case '2': setMotorA(0, 0); setMotorB(+1, motorSpeed);
              Serial.println("Chi banh PHAI tien"); break;
    case 'x': lineFollow = false; stopMotors(); Serial.println("DUNG"); break;
    case '+': motorSpeed = min(255, motorSpeed + 10);
              Serial.printf("Toc do = %d\n", motorSpeed); break;
    case '-': motorSpeed = max(0, motorSpeed - 10);
              Serial.printf("Toc do = %d\n", motorSpeed); break;
    case 'v': motorSpeed = constrain(cmd.substring(1).toInt(), 0, 255);
              Serial.printf("Toc do = %d\n", motorSpeed); break;

    // ----- Encoder / Odometry -----
    case 'e': resetOdometry(); Serial.println("Reset encoder + odometry"); break;
    case 'q': printPose(); break;
    case 'p': {
      long l = encL, r = encR;
      Serial.printf("Encoder  L=%ld (%.1f mm)  R=%ld (%.1f mm)\n",
                    l, pulsesToMM(l), r, pulsesToMM(r));
      break;
    }

    // ----- Servo -----
    case 'o': servo.write(SERVO_DROP); Serial.printf("THA hang (goc %d)\n", SERVO_DROP); break;
    case 'h': servo.write(SERVO_HOLD); Serial.printf("GIU hang (goc %d)\n", SERVO_HOLD); break;
    case 's': { int a = constrain(cmd.substring(1).toInt(), 0, 180);
                servo.write(a); Serial.printf("Servo -> %d do\n", a); break; }
    case 'H': SERVO_HOLD = constrain(cmd.substring(1).toInt(), 0, 180);
              Serial.printf("Goc GIU = %d\n", SERVO_HOLD); break;
    case 'D': SERVO_DROP = constrain(cmd.substring(1).toInt(), 0, 180);
              Serial.printf("Goc THA = %d\n", SERVO_DROP); break;

    // ----- Tu test motor -----
    case 't': {
      Serial.println(">> TEST: A tien 1.5s");
      setMotorA(+1, 200); setMotorB(0,0); delay(1500);
      Serial.println(">> TEST: A lui 1.5s");
      setMotorA(-1, 200); delay(1500); stopMotors(); delay(500);
      Serial.println(">> TEST: B tien 1.5s");
      setMotorB(+1, 200); setMotorA(0,0); delay(1500);
      Serial.println(">> TEST: B lui 1.5s");
      setMotorB(-1, 200); delay(1500); stopMotors();
      Serial.println(">> TEST xong");
      break;
    }
    // ----- Re chuan PID -----
    case 'T':
      if (cmd.length() > 1 && cmd.charAt(1) == 'p') { KpT = cmd.substring(2).toFloat(); Serial.printf("KpT=%.1f\n", KpT); }
      else if (cmd.length() > 1 && cmd.charAt(1) == 'd') { KdT = cmd.substring(2).toFloat(); Serial.printf("KdT=%.1f\n", KdT); }
      else if (cmd.length() > 1 && cmd.charAt(1) == 'V') { turnVerbose = !turnVerbose; Serial.printf("turnVerbose=%d\n", turnVerbose); }
      else if (cmd.length() > 1 && cmd.charAt(1) == 'I') { INVERT_TURN = !INVERT_TURN; Serial.printf("INVERT_TURN=%d\n", INVERT_TURN); }
      else if (cmd.length() > 1 && cmd.charAt(1) == 'n') { TURN_MIN = cmd.substring(2).toInt(); Serial.printf("TURN_MIN=%d\n", TURN_MIN); }
      else if (cmd.length() > 1 && cmd.charAt(1) == 'x') { TURN_MAX = cmd.substring(2).toInt(); Serial.printf("TURN_MAX=%d\n", TURN_MAX); }
      else if (cmd.length() > 1 && cmd.charAt(1) == 'o') { TURN_TOL_DEG = cmd.substring(2).toFloat(); Serial.printf("TURN_TOL_DEG=%.1f\n", TURN_TOL_DEG); }
      else {
        float deg = cmd.substring(1).toFloat();
        Serial.printf(">> Re %.0f do...\n", deg);
        turnRelative(deg);
      }
      break;

    case 'i': // dao chieu runtime: iA hoac iB
      if (cmd.indexOf('A') > 0 || cmd.indexOf('a') > 0) { INVERT_A = !INVERT_A; Serial.printf("INVERT_A=%d\n", INVERT_A); }
      else if (cmd.indexOf('B') > 0 || cmd.indexOf('b') > 0) { INVERT_B = !INVERT_B; Serial.printf("INVERT_B=%d\n", INVERT_B); }
      else Serial.println("Dung: iA hoac iB");
      break;

    // ----- Do line (MUX) -----
    case 'm': streamLine = true;  Serial.println("Stream 8 mat: ON"); break;
    case 'M': streamLine = false; Serial.println("Stream 8 mat: OFF"); break;
    case 'n': printLine(); break;
    case 'c': calibrateLine(); break;

    // ----- Bam line PID -----
    case 'g':
      lineFollow = true; lastError = 0; errIntegral = 0;
      Serial.println("BAM LINE: ON");
      break;
    case 'B': baseSpeed = constrain(cmd.substring(1).toInt(), 0, 255);
              Serial.printf("baseSpeed = %d\n", baseSpeed); break;
    case 'k':
      if (cmd.startsWith("kp")) { Kp = cmd.substring(2).toFloat(); Serial.printf("Kp=%.2f\n", Kp); }
      else if (cmd.startsWith("ki")) { Ki = cmd.substring(2).toFloat(); Serial.printf("Ki=%.2f\n", Ki); }
      else if (cmd.startsWith("kd")) { Kd = cmd.substring(2).toFloat(); Serial.printf("Kd=%.2f\n", Kd); }
      else Serial.println("Dung: kp.. / ki.. / kd..");
      break;

    // ----- Khac -----
    case 'z': beep(150); Serial.println("Beep"); break;
    case '?': printMenu(); break;
    default:  Serial.printf("Lenh khong hieu: '%s' (go ? de xem menu)\n", cmd.c_str());
  }
}

// ===================== Web server =====================
const char PAGE_HTML[] PROGMEM = R"HTML(
<!DOCTYPE html><html lang="vi"><head><meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>ESP32 Car</title>
<style>
 body{font-family:system-ui,sans-serif;text-align:center;background:#111;color:#eee;margin:0;padding:20px}
 h1{font-size:1.4em}
 button{font-size:1.6em;padding:22px 0;width:80%;margin:12px 0;border:0;border-radius:14px;color:#fff;font-weight:700}
 .start{background:#1e9e54}.stop{background:#c0392b}
 #st{font-size:1.1em;margin-top:18px;line-height:1.7em}
 .on{color:#2ecc71}.off{color:#e74c3c}
</style></head><body>
<h1>🚗 ESP32 Car — Bám line</h1>
<button class="start" onclick="cmd('start')">▶ START</button>
<button class="stop" onclick="cmd('stop')">■ STOP</button>
<div id="st">...</div>
<script>
 function cmd(c){fetch('/'+c).then(()=>upd())}
 function upd(){fetch('/status').then(r=>r.json()).then(s=>{
   document.getElementById('st').innerHTML=
    'Trạng thái: <b class="'+(s.run?'on':'off')+'">'+(s.run?'ĐANG CHẠY':'DỪNG')+'</b><br>'+
    'err='+s.err.toFixed(2)+(s.lost?' ⚠️ MẤT LINE':'')+'<br>'+
    'x='+s.x+' y='+s.y+' θ='+s.th+'°';
 }).catch(()=>{})}
 setInterval(upd,400);upd();
</script></body></html>
)HTML";

