huygithcm/code_tung/esp32_car/src/main.cpp
void handleRoot()   { server.send_P(200, "text/html", PAGE_HTML); }
void handleStart()  { lineFollow = true; lastError = 0; errIntegral = 0;
                      Serial.println("[web] START bam line");
                      server.send(200, "text/plain", "started"); }
void handleStop()   { lineFollow = false; stopMotors();
                      Serial.println("[web] STOP");
                      server.send(200, "text/plain", "stopped"); }
void handleStatus() {
  char buf[160];
  snprintf(buf, sizeof(buf),
    "{\"run\":%d,\"err\":%.2f,\"lost\":%d,\"x\":%.0f,\"y\":%.0f,\"th\":%.0f}",
    lineFollow ? 1 : 0, lineError, lineLost ? 1 : 0,
    poseX, poseY, poseTheta * 180.0f / PI);
  server.send(200, "application/json", buf);
}

// ===================== DIEU PHOI: route tu hub =====================
// Gui trang thai xe ve hub (khop {status,node,pos,cargo} ma server.js cho).
// Frame odometry TRUNG frame map (HOME=(0,0), nhin +x=0deg) nen gui thang pose.
void sendTelemetry() {
  if (!hubOK) return;
  const char* st = running ? (cargo ? "moving" : "arrived") : "idle";
  char node[16];
  if (routeTarget.length()) snprintf(node, sizeof(node), "\"%s\"", routeTarget.c_str());
  else strcpy(node, "null");
  char buf[176];
  snprintf(buf, sizeof(buf),
    "{\"status\":\"%s\",\"node\":%s,\"pos\":{\"x\":%.0f,\"y\":%.0f,\"th\":%.0f},\"cargo\":%s}",
    st, node, poseX, poseY, poseTheta * 180.0f / PI, cargo ? "true" : "false");
  wsClient.sendTXT(buf);
}

// Lai tay F/B/L/R (huy route dang chay). 'S'/khac = dung.
void doManual(const String& dir) {
  running = false; lineFollow = false; routeTarget = "";
  char d = dir.length() ? dir.charAt(0) : 'S';
  int s = motorSpeed;
  if      (d == 'F') { setMotorA(+1, s); setMotorB(+1, s); }
  else if (d == 'B') { setMotorA(-1, s); setMotorB(-1, s); }
  else if (d == 'L') { setMotorA(-1, s); setMotorB(+1, s); }
  else if (d == 'R') { setMotorA(+1, s); setMotorB(-1, s); }
  else stopMotors();
}

// Tha hang: dung -> ha servo -> beep -> ve goc giu.
void doDrop() {
  stopMotors();
  servo.write(SERVO_DROP);
  cargo = false;
  beep(120);
  delay(400);                 // cho co cau tha xong
  servo.write(SERVO_HOLD);
  sendTelemetry();
}

// Ket thuc don (da ve HOME): dung, san sang don ke tiep.
void finishRoute() {
  stopMotors(); lineFollow = false;
  running = false; stepPhase = 0;
  routeTarget = ""; cargo = true;
  Serial.println("[route] xong -> ve HOME, san sang");
  sendTelemetry();
}

// Nap chuoi buoc tu hub va bat dau. Re-anchor odometry tai HOME.
void startRoute(JsonArrayConst steps, const char* target) {
  routeN = 0;
  for (JsonVariantConst v : steps) if (routeN < 48) route[routeN++] = String(v.as<const char*>());
  routeIdx = 0; stepPhase = 0; leftStart = false;
  routeTarget = target ? target : "";
  cargo = true;
  resetOdometry();            // xe dang o HOME -> xoa troi tich luy
  running = true;
  Serial.printf("[route] bat dau -> %s (%d buoc)\n", routeTarget.c_str(), routeN);
}

// Chay 1 nhip cua route (goi trong loop khi running).
// Moi buoc F/L/R/B = RE truoc (0/+90/-90/180) roi TIEN 1 canh toi giao diem/het line.
void routeStep() {
  if (routeIdx >= routeN) { finishRoute(); return; }
  String s = route[routeIdx];

  if (s == "DROP") { doDrop(); routeIdx++; return; }
  if (s == "HOME") { routeIdx++; return; }   // buoc cuoi -> finishRoute o nhip sau

  if (stepPhase == 0) {                       // --- Pha 0: re dau doan ---
    float deg = 0;
    if      (s == "L") deg = 90;
    else if (s == "R") deg = -90;
    else if (s == "B") deg = 180;
    if (deg != 0) turnRelative(deg);          // rE tai cho (PID, blocking)
    segStartX = poseX; segStartY = poseY; leftStart = false;
    lastError = 0; errIntegral = 0;
    stepPhase = 1;
    return;
  }

  // --- Pha 1: tien bam line den giao diem ke (hoac het line = tam o) ---
  lineFollowStep();
  float trav = hypotf(poseX - segStartX, poseY - segStartY);
  if (!leftStart && lineCount <= 2 && !lineLost) leftStart = true;   // da roi nga tu cu
  bool done = false;
  if (trav > MIN_EDGE) {
    if (leftStart && (lineCount >= INTERSECT_N || lineLost)) done = true;  // toi nga tu / het line
    if (trav > MAX_EDGE) done = true;                                       // an toan
  }
  if (done) { stopMotors(); stepPhase = 0; routeIdx++; }
}

// Su kien WebSocket toi hub.
void onWsEvent(WStype_t type, uint8_t* payload, size_t len) {
  switch (type) {
    case WStype_CONNECTED:
      hubOK = true;
      wsClient.sendTXT("{\"role\":\"car\"}");
      Serial.println("[ws] Da ket noi hub, khai bao role=car");
      break;
    case WStype_DISCONNECTED:
      hubOK = false;
      Serial.println("[ws] Mat ket noi hub");
      break;
    case WStype_TEXT: {
      JsonDocument doc;
      if (deserializeJson(doc, payload, len)) return;   // loi parse -> bo
      const char* cmd = doc["cmd"];
      if (!cmd) return;                                 // hello/khac -> bo qua
      if      (!strcmp(cmd, "route"))  startRoute(doc["steps"].as<JsonArrayConst>(), doc["target"] | "");
      else if (!strcmp(cmd, "stop"))   { running = false; lineFollow = false; stopMotors(); routeTarget = ""; Serial.println("[ws] STOP"); }
      else if (!strcmp(cmd, "manual")) doManual(String((const char*)(doc["dir"] | "S")));
      else if (!strcmp(cmd, "drop"))   doDrop();
      break;
    }
    default: break;
  }
}

void setupWiFi() {
  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASS);
  Serial.printf("Ket noi WiFi '%s' ...\n", WIFI_SSID);
  unsigned long t0 = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - t0 < 10000) { delay(250); Serial.print('.'); }
  Serial.println();
  if (WiFi.status() == WL_CONNECTED) {
    wifiOK = true;
    Serial.print(F(">> WiFi OK. Mo trinh duyet: http://"));
    Serial.println(WiFi.localIP());
    server.on("/", handleRoot);
    server.on("/start", handleStart);
    server.on("/stop", handleStop);
    server.on("/status", handleStatus);
    server.begin();
    beep(80);
  } else {
    Serial.println(F(">> WiFi FAIL - chay khong web (van dieu khien qua Serial)"));
  }
}

// ===================== Setup =====================
void setup() {
  Serial.begin(115200);
  delay(300);

  // Motor pins
  pinMode(MA_IN1, OUTPUT); pinMode(MA_IN2, OUTPUT);
  pinMode(MB_IN3, OUTPUT); pinMode(MB_IN4, OUTPUT);
  ledcSetup(MA_CH, PWM_FREQ, PWM_RES); ledcAttachPin(MA_EN, MA_CH);
  ledcSetup(MB_CH, PWM_FREQ, PWM_RES); ledcAttachPin(MB_EN, MB_CH);
  stopMotors();

  // Buzzer
  pinMode(BUZZER, OUTPUT); digitalWrite(BUZZER, LOW);

  // MUX 74HC4067
  pinMode(MUX_S0, OUTPUT); pinMode(MUX_S1, OUTPUT);
  pinMode(MUX_S2, OUTPUT); pinMode(MUX_S3, OUTPUT);
  analogReadResolution(12);   // 0..4095

