huygithcm/code_tung/esp32_car/src/main.cpp
  // Encoder pins (input-only 13/14/15/17 deu co pull-up noi)
  pinMode(ENC_L_A, INPUT_PULLUP); pinMode(ENC_L_B, INPUT_PULLUP);
  pinMode(ENC_R_A, INPUT_PULLUP); pinMode(ENC_R_B, INPUT_PULLUP);
  attachInterrupt(digitalPinToInterrupt(ENC_L_A), isrEncL, RISING);
  attachInterrupt(digitalPinToInterrupt(ENC_R_A), isrEncR, RISING);

  // Servo
  servo.setPeriodHertz(50);
  servo.attach(SERVO_PIN, 500, 2400);
  servo.write(SERVO_HOLD);

  loadCalibration();   // nap calibration tu NVS (neu co)
  setupWiFi();         // ket noi WiFi + bat web server

  // WebSocket client toi hub (chi khi da co WiFi)
  if (wifiOK) {
    wsClient.begin(HUB_HOST, HUB_PORT, "/");
    wsClient.onEvent(onWsEvent);
    wsClient.setReconnectInterval(3000);
    Serial.printf(">> Ket noi hub  ws://%s:%d\n", HUB_HOST, HUB_PORT);
  }

  Serial.println(F("\n>> Firmware san sang (dieu phoi route tu hub)"));
  printMenu();
}

// ===================== Loop =====================
unsigned long lastPrint = 0;
void loop() {
  // Doc lenh tu Serial
  if (Serial.available()) {
    String line = Serial.readStringUntil('\n');
    handleCommand(line);
  }

  // Web server + WebSocket client toi hub
  if (wifiOK) { server.handleClient(); wsClient.loop(); }

  // Odometry: cap nhat lien tuc
  updateOdometry();

  // Dieu phoi: chay route tu hub; neu khong, cho phep bam line thu cong (menu 'g')
  static unsigned long lastPid = 0;
  if (running) {
    if (stepPhase == 0) routeStep();                                    // buoc re (blocking) chay ngay
    else if (millis() - lastPid >= 10) { lastPid = millis(); routeStep(); }  // tien PID ~10ms
  } else if (lineFollow && millis() - lastPid >= 10) {
    lastPid = millis();
    lineFollowStep();
  }

  // Gui telemetry ve hub moi 200ms
  static unsigned long lastTel = 0;
  if (hubOK && millis() - lastTel >= 200) { lastTel = millis(); sendTelemetry(); }

  // Stream 8 mat do line moi 200ms
  static unsigned long lastLine = 0;
  if (streamLine && millis() - lastLine > 200) {
    lastLine = millis();
    printLine();
  }

  // In dinh ky moi 500ms (chi o ban DEBUG)
#if DEBUG_MODE
  if (millis() - lastPrint > 500) {
    lastPrint = millis();
    if (lineFollow) {
      Serial.printf("[line] err=%.2f %s | x=%.0f y=%.0f th=%.0fdeg\n",
                    lineError, lineLost ? "(MAT LINE)" : "",
                    poseX, poseY, poseTheta * 180.0f / PI);
    } else {
      static long lastL = 0, lastR = 0;
      if (encL != lastL || encR != lastR) {
        Serial.printf("[enc] L=%ld (%.1fmm)  R=%ld (%.1fmm)\n",
                      encL, pulsesToMM(encL), encR, pulsesToMM(encR));
        lastL = encL; lastR = encR;
      }
    }
  }
#endif
}

